In [7]:
import pandas as pd

data = {
    'customer': ['adnan', 'rehan', 'saad', 'amir'],
    'balance': [50000, 60000, 70000, 80000],
}

df = pd.DataFrame(data)

print(df)

  customer  balance
0    adnan    50000
1    rehan    60000
2     saad    70000
3     amir    80000

In [9]:
# see first 5 coloms
df.head()

  customer  balance
0    adnan    50000
1    rehan    60000
2     saad    70000
3     amir    80000

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   customer  4 non-null      object
 1   balance   4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 196.0+ bytes

In [11]:
df.describe()

            balance
count      4.000000
mean   65000.000000
std    12909.944487
min    50000.000000
25%    57500.000000
50%    65000.000000
75%    72500.000000
max    80000.000000

In [4]:
import pandas as pd
import numpy as np

dict = {
    "name":['adnan', 'rehan', 'saad', 'addu'],
    "marks":[20, 34, 45, 50],
    "city":["lucknow", "panjab", 'delhi', 'mumbai']
}

df = pd.DataFrame(dict)
df

    name  marks     city
0  adnan     20  lucknow
1  rehan     34   panjab
2   saad     45    delhi
3   addu     50   mumbai

In [5]:
df.to_csv('friends.csv')

In [6]:
df.to_csv('friends_index_false.csv', index=False)

In [7]:
df.head(2)

    name  marks     city
0  adnan     20  lucknow
1  rehan     34   panjab

In [8]:
df.tail(2)

   name  marks    city
2  saad     45   delhi
3  addu     50  mumbai

In [9]:
df.describe()

           marks
count   4.000000
mean   37.250000
std    13.301002
min    20.000000
25%    30.500000
50%    39.500000
75%    46.250000
max    50.000000

In [14]:
ser = pd.Series(np.random.rand(34))

In [16]:
type(ser)

pandas.core.series.Series

In [17]:
newdf = pd.DataFrame(np.random.rand(334,5), index=np.arange(334))
newdf

            0         1         2         3         4
0    0.690897  0.107404  0.293371  0.277449  0.863871
1    0.028493  0.533732  0.878535  0.304802  0.174049
2    0.238145  0.038475  0.973761  0.963163  0.389310
3    0.394428  0.104734  0.211470  0.857124  0.972374
4    0.160188  0.427613  0.282617  0.116873  0.374597
..        ...       ...       ...       ...       ...
329  0.088914  0.789884  0.444497  0.870165  0.333619
330  0.290034  0.126650  0.509735  0.303249  0.797047
331  0.893081  0.348220  0.575798  0.258183  0.365517
332  0.855240  0.778725  0.871284  0.946238  0.122053
333  0.945987  0.023670  0.587560  0.133054  0.816381

[334 rows x 5 columns]

In [18]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [20]:
newdf.head()

          0         1         2         3         4
0  0.690897  0.107404  0.293371  0.277449  0.863871
1  0.028493  0.533732  0.878535  0.304802  0.174049
2  0.238145  0.038475  0.973761  0.963163  0.389310
3  0.394428  0.104734  0.211470  0.857124  0.972374
4  0.160188  0.427613  0.282617  0.116873  0.374597

In [22]:
newdf[0][0]= "adnan"

C:\Users\DELL\AppData\Local\Temp\ipykernel_2688\3449927997.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[0][0]= "adnan"
C:\Users\DELL\AppData\Local\Temp\ipykernel_2688\3449927997.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'adnan' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0]= "adnan"

In [21]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [23]:
newdf.head()

          0         1         2         3         4
0     adnan  0.107404  0.293371  0.277449  0.863871
1  0.028493  0.533732  0.878535  0.304802  0.174049
2  0.238145  0.038475  0.973761  0.963163  0.389310
3  0.394428  0.104734  0.211470  0.857124  0.972374
4  0.160188  0.427613  0.282617  0.116873  0.374597

In [24]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int64', length=334)

In [25]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [26]:
newdf.to_numpy()

array([['adnan', 0.10740425937237585, 0.2933709549181761,
        0.2774490610484903, 0.8638713303982477],
       [0.02849307450496219, 0.5337321017566744, 0.8785347586674462,
        0.30480211335458574, 0.17404927318534724],
       [0.23814493785234203, 0.038475037138754886, 0.9737606673058098,
        0.9631633543622493, 0.38931036029601707],
       ...,
       [0.893081261858694, 0.3482197698973363, 0.5757978387051587,
        0.25818252876101677, 0.3655172986305112],
       [0.8552404745689085, 0.7787250774429425, 0.8712835316295136,
        0.9462382416856726, 0.12205253658058912],
       [0.9459874698692011, 0.023670408895908768, 0.5875602046799924,
        0.1330535991591255, 0.8163811369102002]],
      shape=(334, 5), dtype=object)

In [27]:
newdf[0][0]= 0.3

In [28]:
newdf.head

<bound method NDFrame.head of             0         1         2         3         4
0         0.3  0.107404  0.293371  0.277449  0.863871
1    0.028493  0.533732  0.878535  0.304802  0.174049
2    0.238145  0.038475  0.973761  0.963163  0.389310
3    0.394428  0.104734  0.211470  0.857124  0.972374
4    0.160188  0.427613  0.282617  0.116873  0.374597
..        ...       ...       ...       ...       ...
329  0.088914  0.789884  0.444497  0.870165  0.333619
330  0.290034  0.126650  0.509735  0.303249  0.797047
331  0.893081  0.348220  0.575798  0.258183  0.365517
332   0.85524  0.778725  0.871284  0.946238  0.122053
333  0.945987  0.023670  0.587560  0.133054  0.816381

[334 rows x 5 columns]>

In [29]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.3,0.028493,0.238145,0.394428,0.160188,0.369013,0.138371,0.378357,0.712804,0.385932,...,0.722047,0.52106,0.011327,0.525537,0.604952,0.088914,0.290034,0.893081,0.85524,0.945987
1,0.107404,0.533732,0.038475,0.104734,0.427613,0.06806,0.132413,0.776414,0.618881,0.734497,...,0.641103,0.670979,0.564168,0.893916,0.45086,0.789884,0.12665,0.34822,0.778725,0.02367
2,0.293371,0.878535,0.973761,0.21147,0.282617,0.559027,0.134518,0.352541,0.173258,0.999803,...,0.759315,0.196339,0.215966,0.869271,0.131506,0.444497,0.509735,0.575798,0.871284,0.58756
3,0.277449,0.304802,0.963163,0.857124,0.116873,0.460489,0.525339,0.542967,0.385925,0.444454,...,0.316593,0.518388,0.428546,0.745124,0.445892,0.870165,0.303249,0.258183,0.946238,0.133054
4,0.863871,0.174049,0.38931,0.972374,0.374597,0.201342,0.543845,0.163705,0.980046,0.201695,...,0.77416,0.087268,0.82622,0.176421,0.318885,0.333619,0.797047,0.365517,0.122053,0.816381

In [30]:
newdf

            0         1         2         3         4
0         0.3  0.107404  0.293371  0.277449  0.863871
1    0.028493  0.533732  0.878535  0.304802  0.174049
2    0.238145  0.038475  0.973761  0.963163  0.389310
3    0.394428  0.104734  0.211470  0.857124  0.972374
4    0.160188  0.427613  0.282617  0.116873  0.374597
..        ...       ...       ...       ...       ...
329  0.088914  0.789884  0.444497  0.870165  0.333619
330  0.290034  0.126650  0.509735  0.303249  0.797047
331  0.893081  0.348220  0.575798  0.258183  0.365517
332   0.85524  0.778725  0.871284  0.946238  0.122053
333  0.945987  0.023670  0.587560  0.133054  0.816381

[334 rows x 5 columns]

In [31]:
newdf.sort_index(axis=1, ascending=False)

            4         3         2         1         0
0    0.863871  0.277449  0.293371  0.107404       0.3
1    0.174049  0.304802  0.878535  0.533732  0.028493
2    0.389310  0.963163  0.973761  0.038475  0.238145
3    0.972374  0.857124  0.211470  0.104734  0.394428
4    0.374597  0.116873  0.282617  0.427613  0.160188
..        ...       ...       ...       ...       ...
329  0.333619  0.870165  0.444497  0.789884  0.088914
330  0.797047  0.303249  0.509735  0.126650  0.290034
331  0.365517  0.258183  0.575798  0.348220  0.893081
332  0.122053  0.946238  0.871284  0.778725   0.85524
333  0.816381  0.133054  0.587560  0.023670  0.945987

[334 rows x 5 columns]

In [33]:
newdf.head()

          0         1         2         3         4
0       0.3  0.107404  0.293371  0.277449  0.863871
1  0.028493  0.533732  0.878535  0.304802  0.174049
2  0.238145  0.038475  0.973761  0.963163  0.389310
3  0.394428  0.104734  0.211470  0.857124  0.972374
4  0.160188  0.427613  0.282617  0.116873  0.374597

In [34]:
type(newdf[1])

pandas.core.series.Series

In [37]:
newdf.head()

          0         1         2         3         4
0       556  0.107404  0.293371  0.277449  0.863871
1  0.028493  0.533732  0.878535  0.304802  0.174049
2  0.238145  0.038475  0.973761  0.963163  0.389310
3  0.394428  0.104734  0.211470  0.857124  0.972374
4  0.160188  0.427613  0.282617  0.116873  0.374597

In [38]:
newdf2 = newdf

In [39]:
newdf2[0][0]= 9783

C:\Users\DELL\AppData\Local\Temp\ipykernel_2688\3029451393.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf2[0][0]= 9783
C:\Users\DELL\AppData\Local\Temp\ipykernel_2688\3029451393.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][0]= 9783

In [40]:
newdf

            0         1         2         3         4
0        9783  0.107404  0.293371  0.277449  0.863871
1    0.028493  0.533732  0.878535  0.304802  0.174049
2    0.238145  0.038475  0.973761  0.963163  0.389310
3    0.394428  0.104734  0.211470  0.857124  0.972374
4    0.160188  0.427613  0.282617  0.116873  0.374597
..        ...       ...       ...       ...       ...
329  0.088914  0.789884  0.444497  0.870165  0.333619
330  0.290034  0.126650  0.509735  0.303249  0.797047
331  0.893081  0.348220  0.575798  0.258183  0.365517
332   0.85524  0.778725  0.871284  0.946238  0.122053
333  0.945987  0.023670  0.587560  0.133054  0.816381

[334 rows x 5 columns]

In [41]:
newdf.loc[0,0]=654

In [42]:
newdf.head(2)

          0         1         2         3         4
0       654  0.107404  0.293371  0.277449  0.863871
1  0.028493  0.533732  0.878535  0.304802  0.174049

In [43]:
newdf.colums=list("ABCDE")

C:\Users\DELL\AppData\Local\Temp\ipykernel_2688\4080128207.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  newdf.colums=list("ABCDE")

In [44]:
newdf

            0         1         2         3         4
0         654  0.107404  0.293371  0.277449  0.863871
1    0.028493  0.533732  0.878535  0.304802  0.174049
2    0.238145  0.038475  0.973761  0.963163  0.389310
3    0.394428  0.104734  0.211470  0.857124  0.972374
4    0.160188  0.427613  0.282617  0.116873  0.374597
..        ...       ...       ...       ...       ...
329  0.088914  0.789884  0.444497  0.870165  0.333619
330  0.290034  0.126650  0.509735  0.303249  0.797047
331  0.893081  0.348220  0.575798  0.258183  0.365517
332   0.85524  0.778725  0.871284  0.946238  0.122053
333  0.945987  0.023670  0.587560  0.133054  0.816381

[334 rows x 5 columns]